elasticBeam/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/solid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    interface
    {
        type            wall;
        inGroups        1(wall);
        nFaces          192;
        startFace       640;
    }
    symmetry
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          32;
        startFace       832;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          32;
        startFace       864;
    }
)

// ************************************************************************* //
