elasticBeam/constant/solid/solidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      solidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//solidModel    linearGeometryTotalDisplacement;
//solidModel    unsLinearGeometry;
//solidModel    nonLinearGeometryTotalLagrangian;
//solidModel    nonLinearGeometryUpdatedLagrangian;
//solidModel    unsNonLinearGeometryTotalLagrangian;
solidModel    thermalLinearGeometry;

"linearGeometryTotalDisplacementCoeffs|unsLinearGeometryCoeffs|thermalLinearGeometryCoeffs"
{
    // Maximum number of correctors
     nCorrectors    1000;
    
    // Solution tolerance
     solutionTolerance 1e-06;
    // Alternative solution tolerance
     alternativeTolerance 1e-07;
    // Write frequency for the residuals
     infoFrequencyT  100;
}

nonLinearGeometryTotalLagrangianCoeffs
{}

nonLinearGeometryUpdatedLagrangianCoeffs
{}

unsNonLinearGeometryTotalLagrangianCoeffs
{}

unsNonLinearGeometryUpdatedLagrangianCoeffs
{}

// ************************************************************************* //
